benchmark/go-frameworks/results/20260924-102750/results/get/fiber/r1/200000.txt
Running 40s test @ http://10.128.0.4:8085/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 612.129ms, rate sampling interval: 2000ms
  Thread calibration: mean lat.: 648.495ms, rate sampling interval: 2123ms
  Thread calibration: mean lat.: 624.353ms, rate sampling interval: 2045ms
  Thread calibration: mean lat.: 641.911ms, rate sampling interval: 2101ms
  Thread calibration: mean lat.: 614.631ms, rate sampling interval: 2045ms
  Thread calibration: mean lat.: 632.761ms, rate sampling interval: 2058ms
  Thread calibration: mean lat.: 668.457ms, rate sampling interval: 2138ms
  Thread calibration: mean lat.: 612.441ms, rate sampling interval: 1936ms
  Thread calibration: mean lat.: 643.948ms, rate sampling interval: 2068ms
  Thread calibration: mean lat.: 653.646ms, rate sampling interval: 1980ms
  Thread calibration: mean lat.: 623.527ms, rate sampling interval: 2054ms
  Thread calibration: mean lat.: 652.876ms, rate sampling interval: 2123ms
  Thread calibration: mean lat.: 634.652ms, rate sampling interval: 2101ms
  Thread calibration: mean lat.: 647.939ms, rate sampling interval: 2150ms
  Thread calibration: mean lat.: 635.663ms, rate sampling interval: 2077ms
  Thread calibration: mean lat.: 631.797ms, rate sampling interval: 2050ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.31s   774.47ms   4.35s    62.53%
    Req/Sec    11.37k   394.99    11.71k    87.95%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.25s 
 75.000%    2.83s 
 90.000%    3.49s 
 99.000%    3.95s 
 99.900%    4.15s 
 99.990%    4.26s 
 99.999%    4.33s 
100.000%    4.35s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     629.247     0.000000            1         1.00
    1321.983     0.100000       544294         1.11
    1561.599     0.200000      1087494         1.25
    1796.095     0.300000      1630325         1.43
    2026.495     0.400000      2174963         1.67
    2252.799     0.500000      2720493         2.00
    2361.343     0.550000      2989743         2.22
    2471.935     0.600000      3262370         2.50
    2584.575     0.650000      3535798         2.86
    2701.311     0.700000      3806139         3.33
    2832.383     0.750000      4076750         4.00
    2914.303     0.775000      4212987         4.44
    3014.655     0.800000      4345815         5.00
    3139.583     0.825000      4482428         5.71
    3272.703     0.850000      4619323         6.67
    3387.391     0.875000      4754688         8.00
    3440.639     0.887500      4821366         8.89
    3491.839     0.900000      4889192        10.00
    3543.039     0.912500      4958221        11.43
    3590.143     0.925000      5024905        13.33
    3641.343     0.937500      5094249        16.00
    3667.967     0.943750      5128650        17.78
    3694.591     0.950000      5162563        20.00
    3723.263     0.956250      5196623        22.86
    3751.935     0.962500      5228594        26.67
    3784.703     0.968750      5263212        32.00
    3803.135     0.971875      5280347        35.56
    3821.567     0.975000      5296716        40.00
    3842.047     0.978125      5313533        45.71
    3864.575     0.981250      5331752        53.33
    3889.151     0.984375      5347863        64.00
    3903.487     0.985938      5356275        71.11
    3917.823     0.987500      5364336        80.00
    3934.207     0.989062      5372911        91.43
    3954.687     0.990625      5382062       106.67
    3975.167     0.992188      5390260       128.00
    3985.407     0.992969      5394211       142.22
    3999.743     0.993750      5398588       160.00
    4014.079     0.994531      5402526       182.86
    4030.463     0.995313      5407050       213.33
    4046.847     0.996094      5411322       256.00
    4055.039     0.996484      5413435       284.44
    4063.231     0.996875      5415577       320.00
    4071.423     0.997266      5417256       365.71
    4083.711     0.997656      5419505       426.67
    4095.999     0.998047      5421587       512.00
    4104.191     0.998242      5422588       568.89
    4114.431     0.998437      5423699       640.00
    4124.671     0.998633      5424701       731.43
    4136.959     0.998828      5425740       853.33
    4149.247     0.999023      5426835      1024.00
    4155.391     0.999121      5427338      1137.78
    4163.583     0.999219      5427856      1280.00
    4173.823     0.999316      5428429      1462.86
    4184.063     0.999414      5428932      1706.67
    4194.303     0.999512      5429476      2048.00
    4202.495     0.999561      5429792      2275.56
    4210.687     0.999609      5430129      2560.00
    4214.783     0.999658      5430366      2925.71
    4222.975     0.999707      5430599      3413.33
    4227.071     0.999756      5430773      4096.00
    4231.167     0.999780      5430933      4551.11
    4235.263     0.999805      5431089      5120.00
    4239.359     0.999829      5431247      5851.43
    4243.455     0.999854      5431314      6826.67
    4255.743     0.999878      5431481      8192.00
    4259.839     0.999890      5431540      9102.22
    4263.935     0.999902      5431607     10240.00
    4268.031     0.999915      5431658     11702.86
    4280.319     0.999927      5431716     13653.33
    4288.511     0.999939      5431794     16384.00
    4292.607     0.999945      5431819     18204.44
    4296.703     0.999951      5431844     20480.00
    4304.895     0.999957      5431876     23405.71
    4317.183     0.999963      5431911     27306.67
    4321.279     0.999969      5431949     32768.00
    4325.375     0.999973      5432002     36408.89
    4325.375     0.999976      5432002     40960.00
    4325.375     0.999979      5432002     46811.43
    4325.375     0.999982      5432002     54613.33
    4329.471     0.999985      5432058     65536.00
    4329.471     0.999986      5432058     72817.78
    4329.471     0.999988      5432058     81920.00
    4329.471     0.999989      5432058     93622.86
    4329.471     0.999991      5432058    109226.67
    4329.471     0.999992      5432058    131072.00
    4333.567     0.999993      5432068    145635.56
    4333.567     0.999994      5432068    163840.00
    4337.663     0.999995      5432085    187245.71
    4337.663     0.999995      5432085    218453.33
    4337.663     0.999996      5432085    262144.00
    4337.663     0.999997      5432085    291271.11
    4337.663     0.999997      5432085    327680.00
    4337.663     0.999997      5432085    374491.43
    4341.759     0.999998      5432088    436906.67
    4345.855     0.999998      5432094    524288.00
    4345.855     0.999998      5432094    582542.22
    4345.855     0.999998      5432094    655360.00
    4345.855     0.999999      5432094    748982.86
    4345.855     0.999999      5432094    873813.33
    4345.855     0.999999      5432094   1048576.00
    4349.951     0.999999      5432099   1165084.44
    4349.951     1.000000      5432099          inf
#[Mean    =     2310.019, StdDeviation   =      774.465]
#[Max     =     4345.856, Total count    =      5432099]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7208815 requests in 40.00s, 2.55GB read
Requests/sec: 180233.91
Transfer/sec:     65.32MB